//==================================================
// wind.cpp
// Author: Kajita Hiromu
//==================================================
//**************************************************
// include
//**************************************************
#include <assert.h>

#include "wind.h"
//--------------------------------------------------
// コンストラクタ
//--------------------------------------------------
CWind::CWind(int nPriority /* =4 */) : CObject2D(nPriority)
{
	SetType(TYPE_WIND);
}

//--------------------------------------------------
// デストラクタ
//--------------------------------------------------
CWind::~CWind()
{
}

//--------------------------------------------------
// 初期化
//--------------------------------------------------
HRESULT CWind::Init()
{
	CObject2D::Init();

	m_pos = D3DXVECTOR3(0.0f,0.0f,0.0f);
	m_size = D3DXVECTOR3(0.0f, 0.0f, 0.0f);
	m_rot = D3DXVECTOR3(0.0f, 0.0f, 0.0f);
	m_move = D3DXVECTOR3(0.0f, 0.0f, 0.0f);
	m_nFrame = 0;

	return S_OK;
}

//--------------------------------------------------
// 終了
//--------------------------------------------------
void CWind::Uninit()
{
	CObject2D::Uninit();
}

//--------------------------------------------------
// 更新
//--------------------------------------------------
void CWind::Update()
{
	CObject2D::Update();
}

//--------------------------------------------------
// 描画
//--------------------------------------------------
void CWind::Draw()
{
	CObject2D::Draw();
}

//--------------------------------------------------
// 風の設定
//--------------------------------------------------
void CWind::SetWind(D3DXVECTOR3 rot, D3DXVECTOR3 air)
{
}

//--------------------------------------------------
// 向きの設定
//--------------------------------------------------
void CWind::SetRot(D3DXVECTOR3 rot)
{
	m_rot = rot;
}

//--------------------------------------------------
// 生成
//--------------------------------------------------
CWind * CWind::Create(const D3DXVECTOR3 pos, const D3DXVECTOR3 rot,const D3DXVECTOR3 size)
{
	CWind *pWind;
	pWind = new CWind;

	if (pWind != nullptr)
	{
		pWind->Init();
		pWind->SetPos(pos);
		pWind->SetRot(rot);
		pWind->SetSize(size);
	}
	else
	{
		assert(false);
	}

	return pWind;
}
